tsung_test/reports/2/0.8_2/2.xml
<?xml version="1.0"?><tsung loglevel="notice" dumptraffic="protocol" version="1.0">
    
    <clients>
        <client host="localhost"/>
    </clients>

    <servers>
        <server host="192.168.0.101" port="5000" type="tcp"/>
    </servers>

    <monitoring>
        <monitor host="192.168.0.101" type="snmp"/>
    </monitoring>

    
    <load duration="30" unit="minute">   <arrivalphase phase="1" duration="35" unit="minute">
            <users maxnumber="2000" arrivalrate="0.0856" unit="second"/>
        </arrivalphase>
    </load>



    <options>
        <option name="file_server" id="flight_status" value="flight_status.csv"/>
        <option name="file_server" id="choice" value="choice.csv"/>

        <option type="ts_http" name="user_agent">
            <user_agent probability="30">
                Mozilla/5.0 (X11; Ubuntu; Linux i686; rv:24.0) Gecko/20100101 Firefox/24.0
            </user_agent>
            <user_agent probability="20">
                Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/81.0.4044.138 Safari/537.36
            </user_agent>
            <user_agent probability="40">
                Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/81.0.4044.138 Safari/537.36
            </user_agent>
            <user_agent probability="5">
                Mozilla/5.0 (iPhone; CPU iPhone OS 13_4 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) CriOS/81.0.4044.124 Mobile/15E148 Safari/604.1
            </user_agent>
            <user_agent probability="5">
                Mozilla/5.0 (Linux; U; Android 2.2) AppleWebKit/533.1 (KHTML, like Gecko) Version/4.0 Mobile Safari/533.1
            </user_agent>
        </option>
    </options>



    <sessions>
            <session name="session_name" probability="100" type="ts_http">
		    <transaction name="general">
                <setdynvars sourcetype="file" fileid="choice" order="random">
                    <var name="type"/>
                </setdynvars>

                <if var="type" eq="1">
                    <setdynvars sourcetype="file" fileid="flight_status" delimiter=";" order="random">
                        <var name="date"/>
                        <var name="opcarrierflnum"/>
                    </setdynvars>

                    <request>
                        <http url="/query_status" method="GET" version="1.1"/>
                    </request>

                    <request subst="true">
                        <http url="/query_status" method="POST" version="1.1" contents="date=%%_date%%&amp;op_carrier_fl_num=%%_opcarrierflnum%%"/>
                    </request>
                </if>

                <if var="type" eq="2">
                    <request>
                        <http url="/count_flight" method="GET" version="1.1"/>
                    </request>
                    <request>
                        <http url="/count_flight" method="POST" version="1.1" contents="first_date=2010-01-01&amp;second_date=2010-01-31&amp;first_city=Detroit,%20MI&amp;second_city=Miami,%20FL"/>
                    </request>
                </if>

                <if var="type" eq="3">
                 <request>
                        <http url="/query_delay" method="GET" version="1.1"/>
                    </request>

                    <request>
                        <http url="/query_delay" method="POST" version="1.1" contents="op_carrier_fl_num=1908&amp;start_time=2010-01-01&amp;end_time=2010-01-31"/>
                    </request>
                </if>

                <if var="type" eq="4">
                    <request>
                        <http url="/add_record" method="GET" version="1.1"/>
                    </request>

                    <request>
                        <http url="/add_record" method="POST" version="1.1" contents_from_file="contents_add_record.txt"/>
                    </request>
                </if>
            </transaction>
            </session>
    </sessions>
</tsung>